In [8]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot
import seaborn as sns

In [10]:
df = pd.read_csv("Medical_insurance_dataset.csv")

In [11]:
print(df)

      User ID  Gender  Age  EstimatedSalary      Purchased
0    15624510    Male   19            19000  not-purchased
1    15810944    Male   35            20000  not-purchased
2    15668575  Female   26            43000  not-purchased
3    15603246  Female   27            57000  not-purchased
4    15804002    Male   19            76000  not-purchased
..        ...     ...  ...              ...            ...
395  15691863  Female   46            41000      purchased
396  15706071    Male   51            23000      purchased
397  15654296  Female   50            20000      purchased
398  15755018    Male   36            33000  not-purchased
399  15594041  Female   49            36000      purchased

[400 rows x 5 columns]

In [17]:
cols = ["User ID", "Gender", "Age","EstimatedSalary", "Purchased"]

In [18]:
df['Gender'] = (df['Gender'] == 'Man').astype(int)
df["Purchased"] = (df["Purchased"] == "not-purchased").astype(int)

In [19]:
df

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510       0   19            19000          0
1    15810944       0   35            20000          0
2    15668575       0   26            43000          0
3    15603246       0   27            57000          0
4    15804002       0   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863       0   46            41000          0
396  15706071       0   51            23000          0
397  15654296       0   50            20000          0
398  15755018       0   36            33000          0
399  15594041       0   49            36000          0

[400 rows x 5 columns]